noise = c(55.9,63.8,57.2,59.8,65.7,
          62.7,60.8,51.3,61.8,56.0,
          66.9,56.8,66.2,64.6,59.5,
          63.1,60.6,62.0,59.4,67.2,
          63.6,60.5,66.8,61.8,64.8,
          55.8,55.7,77.1,62.1,61.0,
          58.9,60.0,66.9,61.7,60.3,
          51.5,67.0,60.2,56.2,59.4,
          67.9,64.9,55.7,61.4,62.6,
          56.4,56.4,69.4,57.6,63.8)

length(noise)
is.vector(noise)

#평균구하기
mean(noise)
#분산
var(noise)
#표준편차
sd(noise)
#제곱근이므로 검증
sqrt(var(noise))

#사분위수 구하기(type 0~9, 2를 많이 사용)
quantile(noise, type = 2)
min(noise)
max(noise)

#boxplot 구하기(data, 가로/세로로)
boxplot(noise, horizontal = T)
